Repository: KingOfTheAce2/legislation-library-translation-dictionary
Catalog: import/book 4 (para level).tmx
Source language: en_gb
Languages: nl

source: In the application of the General Extension of Time Limits Act ( Algemene termijnenwet ), the time limits set in Articles 114 to 116 inclusive are treated as time limits referred to in Article 1(2) of that Act.
nl: Voor de toepassing van de Algemene termijnenwet worden de termijnen, gesteld in de artikelen 114 tot en met 116, als termijnen in de zin van artikel 1, tweede lid, van die wet aangemerkt.

source: For purposes of this Code, generally recognised public holidays mean the days referred to as such in Article 3 of the General Extension of Time Limits Act ( Algemene termijnenwet ) and the days treated as such by or pursuant to that Article.
nl: Onder algemeen erkende feestdagen worden in dit wetboek verstaan de in artikel 3 van de Algemene termijnenwet als zodanig genoemde en de bij of krachtens dat artikel daarmede gelijkgestelde dagen.
